package cn.studyjams.s1.sj43.jiangjingwei.bean;

/**
 * Created by David on 2016/4/25.
 */
public class FirstBlackText {
    public String[] name = {
            "白き射手ナナリー", "伝説の海賊ミネルバ", "聖女イリス", "魔女デスピア",
            "陰陽師ミコト", "召喚士ファルネ", "伏龍の軍師アイシャ", "魔法皇女エステル", "黒紫の巫女キキョウ",
            "霊鳥の射手スー", "シビラ", "オリヴィエ", "怪力少女ディーナ", "一角獣騎士クリッサ",
            "盗賊ベルナ", "堕天使ソフィー", "光の守護者アルティア", "鉄腕乙女ディーネ", "朱鎧の智将マツリ",
            "天馬騎士団長エスタ", "叛逆の騎士コーネリア", "魔導鎧姫グレース", "新世代山賊アマンダ",
            "月影の弓騎兵リオン", "武王姫アリス", "紅輪の道士ナタク", "鬼神姫ラクシャーサ",
            "九尾狐カヨウ", "時の調停者トワ"};


    public String[] aka = {
            "黑话名:NNL", "黑话名:传说", "黑话名:圣幼女,loli奶", "黑话名:黑冰", "黑话名:mkt",
            "黑话名:哈利波特", "黑话名:伏龙/孔明/智商机", "黑话名:粉婊", "黑话名:桔梗", "黑话名:黑弩",
            "黑话名:喜碧", "黑话名:豆芽", "黑话名:妹盾", "黑话名:一角", "黑话名:呆毛/黑贼",
            "黑话名:掉毛", "黑话名:黑兵", "黑话名:姐盾", "黑话名:幸村", "黑话名:母猪",
            "黑话名:poi", "黑话名:魔盾", "黑话名:肥婆/涉谷妹", "黑话名:月影/弓骑", "黑话名:武王姬",
            "黑话名:哪吒", "黑话名:魔神", "黑话名:狐狸/妲己/灭国狐狸", "黑话名:黑时魔女"};


    public String[] advantage = {
            "职业是弓，最泛用最不可或缺远程物理。射程超远，面板、技能和觉醒被动都无可挑剔，前中后期都是绝对主力。好看，人气单位。",
            "技能非常强悍，即使练度不够也可以靠脸暗杀强行过图。不怎么需要培养对前期推图也有举足轻重的作用。技觉后拥有超高的单点攻击力，可以转型为强力站场远程输出使用。",
            "高奶力，对全队巨额的防御加值可以极大提升队伍的生存能力，同时也可以让王子对盾的要求大幅降低。",
            "拥有很高的稳定性和泛用性。技能觉醒之后拥有非常炸裂的AOE能力。",
            "低c，AOE减速，可以同时干冰和火球的活，初期非常强力。技能5秒时停可以改变战局，式鬼可以提供避雷针和单挡，战术性强。",
            "低c落地点火的广范围AOE，初期就拥有非常惊人的火力。技觉后追加无视魔防的效果，对于高魔抗的强敌也拥有不错的输出保障。落地高火力配合开技一发全屏奶可以提高队伍生存力，救场能力强。",
            "低c，强力2连普攻、技能高爆发AOE、对全队有极强的buff能力，能大幅提升整个队伍的战斗力。",
            "高火力火球，毕业级AOE要员。技能带有全屏减魔防效果，配合其他魔法单位使用可以大幅提高团队输出能力，战略价值高。拥有千年单位中数一数二的颜值。",
            "有最高的常态奶力，觉醒被动可以有效提升全队的输出能力。GR活动可以大幅提高牧场白掉落，对新人凑队伍有一定作用。",
            "强力远程物理，好感加成优秀，从技能到觉醒被动到技能觉醒都非常强力。",
            "职业是难以入手却又极为重要的公主。不需要cc，面板和觉醒被动能力强悍。看板娘，高人气。",
            "职业是难以入手却又极为重要的公主。不需要cc，高攻防可以作为前期即战力。技觉非常强力。",
            "基础职业的顶点，黑盾。泛用性强、出场率高。攻防兼备，技能觉醒非常强力。",
            "能扛能打能回c，能站桩能空降能当避雷针，cost适中的万金油近战。",
            "作为低c单挡拥有惊人的杂鱼歼灭力，自带50%回避能降低治疗压力。",
            "技能状态下歼灭力很高。高魔防可作为优秀的避雷针使用。技觉之后化身最终歼灭兵器，非常强力。",
            "职业是常用的基础职业士兵，开局高速回c能力极大提高队伍展开速度。自身生存能力高，被动技能提高了容错率。",
            "职业是非常常用的盾。面板很高。",
            "醒有很强的近战buff效果，技觉之后化身强力近远。GR活动可以大幅提高牧场白掉落，对新人凑队伍有一定作用。",
            "强力近战物理AOE，应对杂鱼rush时拥有极高的cost恢复能力。",
            "高面板，后期的歼灭力和持久力都可圈可点。",
            "高防御高爆发，同时能干火球和盾的活。字面意义上的强力。立绘出自Alicesoft大手之手，好看。",
            "极高的血量和攻击力，开罐子能力在前期非常便利。提高金桶和经验桶掉率的被动能更快地积攒资源。",
            "强力近远，技觉之后爆发力非常高。",
            "优秀的轻量级挡2，使用安定且有不错的被动AOE，防rush能力极强。好看。",
            "血量和防御出众，生存能力惊人；觉醒之后战力暴涨；出自人气画师时雨之手，好看。",
            "性能超高的决战单位，自身死亡后不影响评价，一定时间后可再次出击。",
            "优秀的低cost挡2，技能觉醒之后高输出魔法AOE和战术性能兼备。好看。",
            "独特的范围减速场，技能配合强力魔女使用拥有很高的爆发力。"};


    public String[] disadvantage = {
            "技能为连射无倍率，对高防御敌人效果不佳。",
            "技能再动长，暗杀不稳定，对于熟练王子来说存在较大的不确定因素。",
            "毕竟辅助职业，在前期存在感薄弱。",
            "魔女的共通缺点，中盘乏力。",
            "战术性太强新人比较难以上手，后期强度有所下降。",
            "无技能状态全程发呆，开技时机需要拿捏，初见地图会有诸多不便。",
            "觉醒前射程较短，技能需要培养才能体现出威力。",
            "她的缺点就是火球的缺点，作为重c远程难以胜任carry全队的位置，要发挥最大价值需要其他强力魔法单位配合。",
            "作为奶射程短，作为冰攻速慢，在目前情况下巫女作为辅助职业依然较为边缘。",
            "不好看。cc需要的银弩在前期难以入手。",
            "对于前期主线图没有太大的贡献，真正的发力期在觉醒之后。",
            "对于前期主线图没有太大的贡献，比西比拉还要晚成。血薄，低练度低技能时不安定。",
            "好感不加防御，对高攻击敌人会有不安定感。晚成。",
            "作为近战没有特别炸裂的特殊能力，显得中规中矩没有亮点。",
            "作为轻型单挡对boss级敌人力不从心，技觉虽然优秀但培养周期较长。",
            "低技状态下持续时间有限，开技时机需要把握。技能高达10级。",
            "技觉前技能状态下几乎没有歼灭力。",
            "cost略重。技能觉醒的实用性和其他两大黑盾有差距。",
            "面板偏低导致前期乏力，自身作战能力有限。",
            "血防有些不安，在技能空档期有些乏力。",
            "cost较高且晚成，觉醒前战斗力有限。技觉前的技能持续时间太短，实用度欠佳。",
            "觉醒被动和技能觉醒比较微妙。",
            "防御低下，在某些时候会有不安定的问题。",
            "作为近战单位没有对空优先，无法胜任弓的职能；职业特性导致近身白刃战疲软。",
            "作为一个黑近战boss战能力有限，也难以为其他单位提供支援。",
            "晚成。",
            "无法治疗难以作为通常单位使用；对新王子前期帮助有限。不好看……",
            "晚成。技觉觉醒后偏战术向，通用性有所欠缺。",
            "尚未开放觉醒，自身强度有限。"};


    public String[] evaluate = {
            "虽然在近期活动中出现了大量高防敌人导致远程物理集体疲软，但娜娜莉依然是最泛用且最强的毕业弓，没什么好说的。",
            "传说是优点和缺点都同样明显的单位。和所有的其他海贼一样，技能期间战斗力出众，但非技能期间因为攻速问题战斗力大打折扣，因此大部分王子都并不太喜欢使用海贼。然而，传说无与伦比的解场能力对于新王子来说是非常好用的，后期也可以通过技觉转型为高技能覆盖的常规远程DPS使用。",
            "圣幼女是一个遇强则强的单位，拥有她可以大幅降低不少后期地图的难度，但是对于新人来说可能在很长的一段时间中都无法理解她的价值所在。",
            "作为基础职业魔女的最上位，黑冰在游戏的前期拥有很高的出场率，无论是推主线还是打活动都非常好用。在全队cc到技觉前的阶段她会出现一段不上不下的疲软期，直到取得炸裂技能觉醒之后。",
            "只要稍加培养并喂满好感，她就是最适合超低练度过王城夺还的角色。可以在一定程度上替代冰和火球也可以有效地弥补初期阵容不齐的问题。",
            "召唤作为双刃剑，一直是争议的焦点。但是初期使用相当不错，在适应其工作方式之后也能发挥不错的战斗力。但其使用不便的缺点会使其在队伍成型之后出场率大降。然而，在目前这个rush类地图越来越多，是个爹就要带高魔抗的时代，哈利波特对于补齐队伍短板、应付各类攻坚难关还是有不错的战术价值。",
            "万能多艺后卫军师爱莎酱，被称为千年唯一7星卡的单位。cc前战斗力较弱，但是后期潜力无限，更重要的是从性能角度来说独一无二，完全没有替代品。",
            "粉婊是属于四平八稳的强力黑，在前期作为强力火球使用算是非常舒服的，在后期成型的队伍中也可以发挥中流砥柱的作用。",
            "从常态奶力来说桔梗无可挑剔，所以大多数情况下桔梗是作为奶使用的。然而巫女职业自身的局限性使她几乎无法成为新人王子渡过前期艰苦难关的助力，也许作为首抽最大的优点就是GR提高牧场白掉率能让王子的队伍更快成型了吧。",
            "无论是前中后期都非常暴力的物理远程，加上弩本身的强势职业特性，战斗力非常高，与娜娜莉相比只输在了泛用性和颜值上。如果觉得立绘可以接受，并且有拿出10w+1银冰换cc素材的觉悟的话，推荐首抽。",
            "各种意义上的千年第一公主，性能强悍不说，觉醒后开技能变远程使她具备了特殊的战略价值。加上人气很高，是很多人梦寐以求的单位。",
            "豆芽是个晚成型黑单位，需要觉醒技觉之后才能发挥她高生存力和惊人的歼灭力，在练度不足奶力又不强的前期实在很难指望脆弱的她能发挥多大战斗力。能回避物理攻击的技能让她在很多时候能充当无敌单位使用，拥有比较高的战略价值。",
            "晚成型黑单位，前期作为高面板的攻击盾来使用比较缺乏亮点。觉醒之后面板获得飞跃，觉醒被动答复提升抗打击能力，技觉霸道的AOE能力使她成为千年当之无愧的一线近战。",
            "高面板、带贯通、能回血、撤退额外回c的特点让她成为了在大多数情况下都能放心往下拍的近战，容错率非常高。由于初期就拥有覆盖优秀的恢复技能，奶力不足的新人使用手感也不错。如果说各种新黑能带给你的是各种酷炫的炸裂能力，那么作为一个四平八稳的传统近战黑单挡，一角能提供的就是无与伦比的安定感。",
            "黑贼是个毁誉参半的单位，特有的被动大幅提高了高暗杀成功率，使她在面对所有没有暗杀耐性的敌人都有很不错的歼灭效果。觉醒和技觉后的高速AOE暗杀能力使她在应付目前所有的地面rush时都不会有什么压力，至于boss，那并不是她的强项。",
            "天使在技能状态下战斗力极强，但是和召唤一样具有平常发呆的毛病。虽然用作挡0避雷针也有一定的价值，但是在大多数时候对于新王子来说是个困扰。在后期技觉之后具有无与伦比的惊人战斗力，但是培养技能个是漫长而痛苦的过程。",
            "士兵的顶点，落地点火回c能让队伍中的强力单位第一时间到达战场，从这个角度上来说黑兵的战略价值是非常高的。觉醒之后可以让所有死亡的士兵自动撤退，本质上算是token化，有一定的战术价值。",
            "由于有天生被动技能的加持，常态防御非常高，在面对大多数敌人的时候都堪称铁壁。技能状态下的超高攻击使她在应对高防敌人时也能拥有不错的歼灭力，技觉之后的AOE范围和威力也很可观。尽管由于技能实用度的问题使她的评价不如妹盾蒂娜和黑魔盾格蕾丝，她的实力也无愧于黑盾的称号。",
            "幸村由于自身面板的关系战斗力有限，在前期很难为新人王子提供太大的助力，其主要价值主要还是在于后期的团队buff和技觉之后的近远能力，另外就是和桔梗一样能大幅增加GR牧场白掉率，为新王子组建队伍提供便利。",
            "目前杂鱼rush地图越来越多，天马的AOE回C能力地位高涨，而立于天马顶点的她，地位也随之上升了不少，算是非常便利的单位。由于攻击力非常高，技觉之后还会进一步追加攻击倍率，配合自身技能持续时间较长的优点，在清理杂鱼之外用于AOE辅助输出也有不错的效果。",
            "和其他所有的DK一样属于大器晚成的职业，虽说在前期依靠自身的面板和魔防姑且可以一用，但只有在觉醒之后才能体现出其真正的战斗力。技觉之后可以算是游戏中最硬的单位之一，配合自身不错的输出能力使其成为了不错的决战兵器。另外，由于游戏中大部分难缠的大爹都是不死或恶魔，她的觉醒被动在后期的战斗中大有用武之地。",
            "魔盾本来就是强势职业，立于职业顶点的黑单位自然不用说。同时能干火球和盾的活很大程度上缓解了初期队伍不齐的压力，同时拥有了她也等于拥有了一个强悍的决战单位。",
            "山贼的顶点，拥有一切山贼的优点和一切山贼的缺点，因此她的定位自始自终也没有超出山贼的范畴。自身HP很高，技觉之后更可以达到惊人的数值，在顶某些高攻大爹的时候会意外的有用。",
            "弓骑的顶点，拥有全游戏数一数二的爆发力，从前期到后期都有不错的歼灭力。被动技能可以减少包括自己在内骑兵系的cost，实际上自身还是比较轻量的。然而弓骑职业近接战能力薄弱，在摆放位置上会比较讲究，使用起来显得不是那么安定省心。",
            "自带的被动AOE配合自身技能的高倍率拥有相当不错的歼灭力，防御力不错、自带回避、技觉还能永续性提高最大HP让她拥有了不错的生存能力，即使面对中型敌人也能面无惧色，可以说是将格斗的本职工作做到了最好。",
            "觉醒前拥有2400血量和1000以上裸防，堪称不沉的浮空要塞，避雷性能首屈一指。前期虽然火力不足，但是胜在可以随便乱拍而且不容易死，在使用上比较无脑。觉醒之后攻击力暴涨，配合高机率连击的被动一跃成为千年最优秀的近远单位之一。技觉之后的15秒近远真伤爆发更是惊艳，是值得信赖的后期单位。",
            "自身极高的面板，超强的技能和战术化觉醒被动、死亡或撤退一定时间后可再次出击的特性无一不在宣示这就是一个为决战而生的单位，在对付目前大多数boss的时候都能发挥独特的作用。另外，自身无限出击的特性配合死亡AOE伤害+时停的特殊能力也可以玩出不少花样来，算是强度和趣味性兼具的好单位。",
            "在技能觉醒前作为面板较高的打2格斗使用，比较缺乏亮点，在技能觉醒后能发挥出独特的战术效果，在对付特定地图的高血boss或是某些难以处理的rush时会有奇效。然而因为第一发大炎上的爆发时间比普通黑单位迟，吸精的全屏扣血有时会给队伍带来负担，在实际使用上需要拿捏。",
            "目前主要价值在于配合其他强力魔女打瞬间爆发，或是配合mikoto之类的减速单位将散步战术发挥到极致。目前看来是中规中矩的辅助黑，可以期待开放觉醒和技能觉醒之后的实战效果。 "};


    public String[] remark = {
            "娜娜莉,作为首抽黑还是比较推荐的,首先是可以用到老的弓,然后可以帮助前期偷渡王城夺还,和猫弓进行配合,再用魔水晶换一个丝碧卡," +
                    "弓的队伍就算成型了.",
            "传说,渣渣没有传说_(:зゝ∠)_,不太懂...",
            "圣幼女,Null",
            "黑兵,技能觉醒后人称洗衣机",
            "MKT,Mikoto(日文音) is God（曾经创出1X级王子过王城的奇迹得名，时代眼泪之一）",
            "哈利,因为长得像...由立绘得名",
            "伏龙,技觉之后丢弃智商（低c超长射程大范围轰炸，一键解决地图各种机关得名）",
            "粉婊,曾经坑了很多欧爹的粉毛，小碧池",
            "桔梗,Null",
            "黑弩,...黑的不行",
            "喜碧,在群里叫西拉比的会被塞口球(很可怕)。觉醒版又称毁容",
            "豆芽,一般只说豆芽的话都是指代她",
            "妹盾,技能觉醒又称为飞锤,铁球",
            "一角,Null",
            "黑贼,Null",
            "掉毛,单说掉毛一般指她",
            "黑兵,也称为真剑,因为某社画师代表作真剑",
            "姐盾,Null",
            "幸村,Null",
            "母猪,之所以这么叫大概是因为H情节前后反差较大",
            "poi,觉醒立绘像某舰夕立",
            "魔盾,Null",
            "黑山贼,小老虎萌(应该是指立绘里面的小老虎..)",
            "月影,单说弓骑一般指他",
            "武王姬,Null",
            "哪吒,Null",
            "鬼神,麻宫骑亚大师的作品，虽然是上世纪80年代的画风实在无法被人接受，但是实力堪称7星卡",
            "狐狸,S1群主教皇抽了15单没有抽到的单位，亦让很多群友抽搐而死，因此得名灭国狐狸（PS：第二次UP时教皇终于抽到了）",
            "黑时魔女,Null"};



    public String[] getName() {
        return name;
    }

    public String[] getAka() {
        return aka;
    }

    public String[] getAdvantage() {
        return advantage;
    }

    public String[] getDisadvantage() {
        return disadvantage;
    }

    public String[] getEvaluate() {
        return evaluate;
    }

    public String[] getRemark() {
        return remark;
    }
}
