package cn.studyjams.s1.sj43.jiangjingwei.utils;

/**
 * Created by David on 2016/4/26.
 */
public class CustomTextUtils {

    public static final String ARG_POSITION = "position";

    public static String css = "file:///android_asset/foghorn.css";

    public static String[] file_prime_strategy = {
            "file:///android_asset/charm.md",
            "file:///android_asset/strength.md",
            "file:///android_asset/mission.md"};

    public static String[] name_prime_strategy = {
            "妖精郷の射手スピカ",
            "妖精女王シーディス",
            "閃の撃砲ジャンナ",
            "黒衣のサイラス",
            "忍者ヒエン",
            "妖精魔鎧兵ライチ",
            "忍者サキ"
    };

    public static String[] introduce_prime_strategy = {
            "丝丝。千年第一良心活动单位，最重要的魔水晶交换单位。\n" +
                    "普攻输出可以媲美黑弓，天生比白弓低1c，技能泛用性极高且有专用的银技能素材，优秀的觉醒被动等等，使丝丝成为了无论任何王子都必须入手的重要单位。在种种优点面前，贫血和技能初动的问题显得完全不重要。\n" +
                    "毋庸置疑，在入手之后也拥有最高的育成优先级。如果她在交换所中出现，建议砸锅卖铁也要尽快入手。",
            "女王奶。妖精族的特性使她在牺牲血量的同时拥有了非常高的面板攻击，技能奶力和射程兼顾且长持续的特性使她可以胜任长时间的消耗战。觉醒被动为祖传魔抗+10，非常残念，因此觉醒优先级非常低。\n" +
                    "作为白奶中规中矩，但是对于吴克和微氪王子来说很可能是很长一段时间内手中最强的恢复单位。如果手中没有更好的奶的话，请不要错过。",
            "闪炮。较高的面板，优秀的扩散弹技能使她对得起200魔水的价值，可以使用银炮作为技能素材也算是很大的优点。\n" +
                    "但是，由于火球职业的优秀性能，炮的出场率并不高，再加上卡池存在性能非常优秀的砲術士メル（76" +
                    "炮），使白炮的交换优先级并不高。建议在魔水晶比较充足的情况下再考虑兑换。",
            "黑爷。你没看错，就是黑爷，黑爷也会在交换所中出现。\n" +
                    "鉴于初期好的火球非常难以入手，银火球自身又是非常紧缺的素材，能用魔水晶交换的黑爷价值自然不言而喻。如果新手王子缺火球，并且有能力支付70魔水晶的话，黑爷是个不错的选择。",
            "飞燕，卡池无法抽出。飞燕对吴克和微氪玩家来说算是比较容易入手的忍者，成本低廉；持有的攻击III" +
                    "技能泛用性高且易于培养，性价比非常高。与交换所的黑忍忍者サキ（saki）用途不尽相同，算是互补的关系。\n" +
                    "如果手边没有好的近战远程的话，推荐兑换飞燕。",
            "金魔盾。魔盾作为强力职业，在目前的游戏中地位很高。良好的生存能力加上魔法AOE，是非常便利的强力金单位，无论是缺盾或是缺近战AOE的王子都可以使用，能非常有效地弥补新人王子的队伍短板。",
            "saki。与卡池的忍者ヒナ（hina）和收集活动可以入手的封妖の忍者ナギ（nagi" +
                    "）相比，没有攻击力强化技能，取而代之的是暗杀能力。攻击面虽然不如前两者，但是落地暗杀在特定地图会有特殊的战术效果。觉醒之后获得攻击速度up的被动，技能觉醒之后获得射程扩大3体同时暗杀的能力，算是非常大的提升。\n" +
                    "虽然并不建议在初期就以交换saki为目标积累魔水晶，但鉴于saki" +
                    "算是最容易入手的黑单位，加上近期活动对于近战远程的需求量越来越大，仍然建议在把最重要的魔水晶交换单位入手之后，考虑兑换saki。"
    };


    public static java.lang.String[] file_pac = {
            "file:///android_asset/shiLian.md",
            "file:///android_asset/shouJi.md",
            "file:///android_asset/muChang.md",
            "file:///android_asset/GR.md",
            "file:///android_asset/taoFa.md",
            "file:///android_asset/yaoRi.md",
            "file:///android_asset/jueXing.md",
            "file:///android_asset/fuKe.md"
    };
    public static String[] title_pac = {
            "试炼",
            "收集",
            "牧场",
            "Gold Rush",
            "大讨伐",
            "曜日1.5倍",
            "觉醒宝珠1.5倍",
            "复刻活动"
    };
    public static String[] file_feed = {
            "file:///android_asset/feed_chart.md",
            "file:///android_asset/feed_basic.md",
    };
    public static String[] name_feed_tutorial = {
            "铁圣灵",
            "铜圣灵",
            "银圣灵",
            "金圣灵",
            "白圣灵",
            "黑圣灵",
            "女王(蓝宝石)圣灵",
            "虹圣灵",
            "觉醒圣灵",
            "技觉醒圣灵",
            "时圣灵",
            "祝福圣灵",
            "祝福圣灵",
            "劳苦功高的白桶"
    };
    public static String[] introduce_feed_tutorial = {
            "基础圣灵：铁圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：铜圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：银圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：金圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：白圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：黑圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。",
            "基础圣灵：女王（蓝宝石)圣灵，主要作用为为同稀有度单位转职（cc）时使用，及配合狗粮或桶加成经验倍率食用。\n注：女王圣灵可以替换该类任意一种圣灵，同时蓝宝石单位cc时只能使用女王圣灵",
            "食用后可以增加单位的技能，增加几率如下：\n" +
                    "以5技能为例\n" +
                    "1升2：100%\n" +
                    "2升3:  75%\n" +
                    "3升4:  50%\n" +
                    "4升5： 25%\n" +
                    "在非5技能单位使用时，第一次固定100%，最后一次固定25%，期间技能到总技能数的一半前几率为75%，之后为50%\n",
            "交换所常驻，需要使用周四五曜日掉落的魔水晶交换，价格为100魔水，单位觉醒时使用。",
            "周六日曜日图，強者の集う戦場中敌方黑单位死后随机掉落，掉落数量0-4个不等，用于单位技能觉醒，距离新王子太遥远，这里不讨论",
            "使用安利号入坑的王子多半会发现礼物箱里有时圣灵存在，此圣灵为2014年龙姬妇科时地图bug补偿所得。时圣灵作用有2个，第一是100%为一个单位减少1点cost，第二是黑稀有度单位龙人觉醒为龙姬时的素材之一，按照一般掉率估算，一个时圣灵的价值约为20水晶，平时无法获取。请不要随意使用。",
            "全民大讨伐增加该单位经验，传说中的觉醒后一发飞上99的圣灵，平时无法获取",
            "全民大讨伐增加该单位经验，传说中的觉醒后一发飞上99的圣灵，平时无法获取",
            "基础经验为1000的白桶,根据上面可知，同色圣灵加成2倍，最多加成3个。\n" +
                    "适当的吃桶可以节约大量的时间和金钱，更快的提升队伍练度。\n" +
                    "参照吃桶表可以避免出现差一点点满级导致浪费大量金钱的情况出现。\n（套桶即为同色圣灵3个加桶1000*8=8000经验一套）\n"
    };
}
